
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 4 to change, 1 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.app_insights_connection_string
  * azurerm_key_vault_secret.app_insights_key
  * module.postgresql_flexible.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;shared_buffers&#34;]
  * module.vault.azurerm_monitor_diagnostic_setting.kv-ds
* Replace
  * module.application_insights.azurerm_application_insights.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.app_insights_connection_string will be updated in-place
  ~ resource "azurerm_key_vault_secret" "app_insights_connection_string" {
        id                      = "https://camunda-aat.vault.azure.net/secrets/app-insights-connection-string/73bfbb449cd047c88a286ad40c78bd08"
        name                    = "app-insights-connection-string"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.app_insights_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "app_insights_key" {
        id                      = "https://camunda-aat.vault.azure.net/secrets/AppInsightsInstrumentationKey/8ca4f4fee6b940ebb0ab1b1853a36c38"
        name                    = "AppInsightsInstrumentationKey"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # module.application_insights.azurerm_application_insights.this must be replaced
  # (moved from azurerm_application_insights.appinsights)
-/+ resource "azurerm_application_insights" "this" {
      ~ app_id                                = "485fffbc-fcfd-4887-993e-5f8cb42f0cd8" -> (known after apply)
      ~ connection_string                     = (sensitive value)
      ~ daily_data_cap_in_gb                  = 100 -> 50
      ~ daily_data_cap_notifications_disabled = false -> (known after apply)
      ~ id                                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/camunda-aat/providers/Microsoft.Insights/components/camunda-bpm-appinsights-aat" -> (known after apply)
      ~ instrumentation_key                   = (sensitive value)
      ~ name                                  = "camunda-bpm-appinsights-aat" -> "camunda-bpm-appinsights-aat-aat" # forces replacement
        tags                                  = {
            "application"         = "core"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/camunda-bpm.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "staging"
            "managedBy"           = "Software Engineering"
        }
      + workspace_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
        # (10 unchanged attributes hidden)
    }

  # module.postgresql_flexible.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["shared_buffers"] will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
        id        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmcts-camunda-v14-flexible-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/hmcts-camunda-v14-flexible-aat/configurations/shared_buffers"
        name      = "shared_buffers"
      ~ value     = "786432" -> "2097152"
        # (1 unchanged attribute hidden)
    }

  # module.vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/camunda-aat/providers/Microsoft.KeyVault/vaults/camunda-aat|camunda-aat"
        name                           = "camunda-aat"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 4 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":711,"Program":"tfcmt","SHA1":"","Vars":{}} -->